[{"judul": "SH4", "konten": "With this weeks announcement that the smart home standard Matter has finally launched and the possibility that we could see Matter devices arriving any day now, I wanted to round up answers to some of the most common questions Ive heard in the last few days. If you have no idea what Matter is, my explainer on Matter is the place to start. But if you have more specific questions, the answers should be here. If you just want to know what devices will work with Matter, weve covered that in another blog, which well update as new products get announced. Theres still a lot we dont know about Matter, and we wont know until we get Matter-enabled products in our homes and the apps and ecosystems are updated. But there are plenty of things we do know, as well as some stuff we can speculate on. Last week, I attended the CEDIA Expo, where I hosted a panel on Matter and interviewed representatives from Google, the Connectivity Standards Alliance (CSA), Yale, and Z-Wave, many of whom have been involved with Matter from the beginning. I posed these questions to them, as well as researched answers from published materials to help you understand what the launch of Matter means to your smart home today.   Matter is a new language for smart home devices. Once your smart door lock can easily talk to your smart speaker or your smart light switch can communicate smoothly with your thermostat, the hope is that the connected home will become less complicated.Over the last 10 years, there has been an organic growth of the smart home thats created a lot of challenges, says Kevin Po of Google Nest. One of those is that these devices cant all speak the same language. With Matter, we have a chance to get them all talking the same language. Matter is like hitting a big reset button for the smart home, laying a foundation from which a smarter, more interoperable home can grow.There are already so many smart home protocols. Why do we need another one? While, technically, Matter is a smart home interoperability protocol, its not an entirely new protocol. Matter is an application layer over existing protocols Wi-Fi and Thread. Its open source, not proprietary, and it works over your local network, so it doesnt rely on the cloud. With Matter, instead of using two or three separate apps and connecting their cloud service back-ends to get your smart plug to turn on your lamp when you unlock your front door, that plug and lock can chat directly with each other, and you can set up the automation using one Matter Controller app.Matter is not replacing existing protocols. Bluetooth, Zigbee, and Z-Wave will still be part of smart homes (and Bluetooth LE is used for adding devices to Matter). Any smart home gadgets you have that use these technologies should be able to be bridged into Matter (more on this in a bit).Why are all these competitors on board? Whats in it for them?Matter was developed initially by a number of big companies in the tech space, including Apple, Google, Amazon, Samsung SmartThings, and Comcast. There are now over 280 companies on board — the list is like a whos who of IoT. But why did they all decide to work together?The smart home wasnt developing the way many had hoped. There were major pain points that were making it hard to grow and expand. Reliability, connectivity, setup, and the multi-platform problem were the key areas Michele Turner of Google identified in my interview with her earlier this year. The early promise of seemingly limitless growth had faded in the face of complexity and user frustration. The big tech companies and the hundreds of IoT device manufacturers saw this bottleneck and realized they needed to work together.You can ask Siri to control your Nest thermostat and turn on your Fire TV — if you live in that kind of crazy, Frankensteinian home Since I started to cover Matter, I have heard the phrase a rising tide lifts all boats repeatedly. Once the smart home is easier to set up and use, there will be more people buying devices, which is something every company wants to see. Google has announced its Nest speakers and smart displays will be Matter controllers.Will Matter mean there are more smart home devices?Before Matter, device makers had to either pick a protocol to work over or develop several different models or integrations to give customers choice. This was harder and more expensive for them and wildly confusing for us. Kevin Kraus of lock manufacturer Yale told me, Weve developed over a dozen modules for different platforms to make our locks work with them. The promise of Matter is I only have to create one module. He points out there are plenty of companies that today only make a product for Z-Wave or Zigbee or Bluetooth because it costs them too much to try and diversify. Now, all those manufacturers will have the option to pick one protocol that is intended to work with every platform. If Matter delivers on that promise, that goes a huge way to solving that problem and bringing many more manufacturers into the fold, he says.Eve, for example, chose to work just with Apple HomeKit, developing only Bluetooth and Wi-Fi devices for that platform. With Matter, the company plans to expand to more platforms. The downside is Matter will only work with a small number of device categories at launch. These are smart light bulbs and fixtures, smart plugs and switches, smart thermostats and other HVAC controls, smart shades, smart sensors, connected locks, and media devices, including TVs. But the CSA is already working on new device types, including security cameras and robot vacuums. This is just Matter 1.0, says Michelle Mindala-Freeman of the CSA. Theres a whole backlog of things — device types, capabilities — that [is being] worked on for subsequent releases.If Matter uses Wi-Fi, does that mean my entire home is now on the internet?No. Matter uses local networks in your home — Ethernet, Wi-Fi, and Thread (Thread is an IP- and mesh-based protocol) — and works entirely locally. Nothing is going to the internet or the cloud unless you use a Matter Controller or device app that talks to the cloud. The main reason to do this will be for controlling your home remotely when you are away or for connecting to cloud-based services, such as music streaming or voice assistants.Security is part of the Matter SDK, as well as data privacy principles. The CSA has published a white paper that goes into specific details, but the concept is built around trusted devices, trusted controllers, and private communication.What is a Matter Controller?A Matter Controller is how you control Matter devices in your home. Its the brains of the system. Like a Thread border router, controller functionality can be built into many devices, and you can have multiple controllers. We already know that devices like Amazon Echo and Nest Hub speakers and smart displays will be controllers. Controllers can also be Thread border routers, but they dont have to be.Apples HomePod Mini is a Thread border router and will be a Matter Controller.A Matter controller can also be a bridge or hub; Samsungs SmartThings hubs, TVs, and appliances will be controllers, as will Apples HomePod Mini. Its also possible that bridges and hubs from manufacturers like Philips Hue and Aqara could be controllers (Aqara has said it will update its M1S and M2 hubs to Matter). Finally, Matter-enabled smartphone apps — such as Apple Home, Google Home, Amazon Alexa, or Samsung SmartThings — are also controllers. These will be where you set up routines and automations in your smart home. The companies listed have all said their apps will be Matter Controllers, but there will likely be many more options. Will I need a bridge or a hub to run Matter?Matter doesnt require a central bridge or hub. Instead, it allows devices to talk directly to each other — either over Wi-Fi or Thread — which are then managed by a Matter Controller.Thread devices do require a Thread border router to route communications from Thread devices to Wi-Fi devices. Thread border routers are already in a lot of common smart home devices — from Wi-Fi routers to smart speakers to smart lights — and well likely see more soon.Isnt a Thread border router just a bridge?With bridges and hubs, theres a translation that happens; they see the data sent to them and then translate it from one environment to the other, says Googles Po. A router only routes data. It doesnt translate or even see the packages its transferring. Thread is also a mesh network, and you can have multiple Thread border routers in your home to strengthen the network. If one stops working, another can pick up the slack. That is not currently the case if your Zigbee or Z-Wave bridge or hub stops working. Eero Wi-Fi routers are Thread border routers, too. Will my existing smart home devices get upgraded to support Matter?This is going to depend on the manufacturers. Many, including Ikea, Philips Hue, Yale, Sengled, Tuya Smart, Cync, Aqara, Wiz, Wemo, Schlage, TP-Link, and Eve, have said some or all of their existing compatible products will be upgraded to Matter. How that will happen will vary depending on the device. If, like Philips Hue or Aqara, the products rely on a bridge or hub, it may be possible for that device to receive an over-the-air firmware update and bring all the lights and devices connected to it into Matter. Alternatively, a company may decide to release a new bridge or gateway to bring existing devices into Matter — which is what Ikea has done.An upgradeable or a new gateway that is Matter compatible will enable Z-Wave and Zigbee devices to be recognized as though they are Matter devices, says Mitchell Klein of the Z-Wave Alliance. And not only existing devices in peoples homes but all the devices still on the store shelves and in manufacturers warehouses.Its also possible well see Matter bridges released that can translate communications from multiple ecosystems. Silicon Labs has developed Unify SDK, a software and hardware solution for bridging Zigbee and Z-Wave into Matter. This bridge doesnt have to be another little white box; it could be built into devices like a thermostat, says Klein. Infineon has announced several Matter SoC solutions for device makers, and other chip makers are following suit.Some individual devices will require hardware changes to be Matter-compatible. Eves smart plugs and Yales locks are two examples — Yale using swappable modules for its locks and Eve adding Thread radios to many of its devices. However, Matter works over Wi-Fi and Thread, so some products might be upgradeable with just an over-the-air update. Amazon and Google have said their existing smart speakers and displays will be upgraded this way, and we should hear more about other companies plans now that the final spec is out.Will Matter make it easier to buy new devices?Yes. Thats sort of the whole point. If a device works with Matter, it will have the Matter logo (which looks like a stick person in bikini bottoms). Thats your sign it will work in your smart home. The other promise is simple setup. Matter devices will pair directly to your smartphone — no app needed, as Google demonstrated this week. Apple and Samsung have also got programs in place to enable this on their smartphones and tablets. Once the device is paired to your Matter network, then you can choose which app you want to control it through.The new Google Home app will be a Matter Controller and can control both Matter and non-Matter devices.Does this mean I can just use one app to control my whole home?Yes and no. All Matter devices will work with all controller apps — because Matter has something called multi-admin control built in. They can also be controlled by more than one controller. But devices may not have access to all their features through that app. For example, at launch, Matter wont support more advanced features, like energy monitoring in a smart plug or complicated scene control for smart lights. So, if you wanted to set up energy monitoring or have your colored smart bulbs pulsate with the shades of your football team, you would need to use the devices app or an app that supports the functionality you want. At least for now.Can I use non-Matter and Matter devices in the same smart home routines? It depends on what each ecosystem allows, but Amazon, Apple, and Google have all publicly stated they will fully integrate with Matter. Samsung has been less clear. In the Google Home app, Matter devices will sit alongside the ones that youve already connected with through the Works with Google program and work together, confirms Po.Can I use Apples Siri to control my (new) Nest thermostat and turn on my Amazon Fire TV?The big selling point of Matter from day one has been multi-admin control — that you can use any app, any ecosystem to control any device — including with voice control using any voice assistant. But this requires each Matter Controller manufacturer to allow it.Matter provides common controls, but beyond that are customizations.It depends on how different product manufacturers and platforms choose to integrate the Matter protocol, says Googles Po. Were wholly committed to Matter. So thats why were updating the [new] Nest thermostat to be a Matter device. And it will be controllable by Matter controllers if other companies choose to implement the micro-controller functionality into their devices. So, if Amazon, Apple, and Google all enable this feature, then yes — you can ask Siri to control your Nest thermostat and turn on your Fire TV — if you live in that kind of crazy, Frankensteinian home. But thats still a big if.Will I be able to use devices in multiple ecosystems?There will not be one Matter-branded app. Instead, you will pick a platform to run your Matter home on. That could be Apple Home, Google Home, Amazon Alexa, Samsung SmartThings, or another ecosystem or app yet to be announced as a Matter Controller. Those companies will all compete to get you to use their apps by offering better or different experiences. Matter provides common controls, but beyond that are customizations, says Po. Ecosystems will want new ways to show the benefits of their user experiences. New features built on top of Matter. This is that smarter, more interoperable home we were talking about at the beginning.But because all Matter devices speak the same language, you should be able to use them in different ecosystems at the same time or switch between platforms at will. How exactly these flows will happen isnt known yet. And, if smart home companies are anything like cellular carriers, there may be roadblocks one way and lots of incentives the other way. The key point here is that you are no longer locked into one smart home ecosystem, and that can only be a good thing.Should I be excited or skeptical about Matter?Both. Matter is a big change for the smart home that has made a lot of big promises. But its also been a big challenge, judging by the number of delays. Mindala-Freeman of the CSA stressed to me that the original vision of Matter is still in place — in terms of how transformational it could be for the smart home. But she says there is still a lot of work to be done and that the release of Matter 1.0 is just the beginning."}]