[{"judul": "SC4", "konten": "Alexa has an answer for almost everything, but when Amazon announced earlier this year that its digital voice assistant can now field health-related queries, I was more than a little skeptical. Make no mistake, Alexa is a wise and powerful digital sage — thats half the reason Amazon Echo devices rank among the best smart home devices weve tested the other half being sound quality and device performance. However, when it comes to my health, Im used to trusting living, breathing medical professionals, and I bet you are, too. Before I pitted Alexa against a litany of ailments, both mine and others, I had some serious questions: Could an AI, even one rigorously trained on the nuances of human speech, really parse my health symptoms and return a list of possible causes? Would the responses be thorough, accurate and relevant? Would the interactions be meaningful? After testing the new feature several times throughout the last month, I can answer those questions and more with a resounding if slightly astonished, Yes. What the new Alexa Symptom Checker is and isnt The idea to develop a general-purpose symptom checking feature was initially sparked by Alexas Covid-19 symptom checker, an earlier, more-targeted health-related release. This debuted in March 2020 and worked in a similarly conversational fashion. Essentially, the new symptom checking feature lets you relay a list of any medical symptoms youve been experiencing to Alexa, who will then ask follow-up questions before responding with a list of 10 possible conditions that may be causing your symptoms. To begin the symptom checker interaction, say, Alexa, check my symptoms. From there, Alexa will ask a series of yes-or-no questions to help narrow down which underlying medical conditions might be related. You can start this conversation on any Amazon Echo, including speaker-only devices like the Echo and Echo Dot, but for the best experience youll want to use an Alexa device with an attached screen like an Echo Show smart display, Amazon Fire Tablet or Fire TV. Echo Show adds a visual element to help you and Alexa zero in on potential medical conditions  for example, a graphic pain scale with line-drawn faces from smiley to frowny can help you decide on a number when Alexa asks how much something hurts between zero and 10. Amazon makes it clear that these interactions are for educational purposes only and that Alexa s responses do not constitute medical advice. Think of it less like consulting with a real medical professional and more like doing a web search or gathering information from sites like WebMD or Healthline. Alexa is always evolving — and we spoke to Amazon to learn more The advancements we ve made in conversational speech technology have opened the door for people to access information in new ways, and that s what drove the development of Alexa s symptom checker, said Amazon Vice President and Chief Operating Officer Debra Chrapaty, who oversees Amazon Alexa, over email. It s built so you can just tell Alexa the symptoms you re feeling, answer yes-or-no questions and learn about the possible causes — all without having to fill out forms. How thorough is Alexa Symptom Checker? According to Amazon, Alexa symptom checker currently supports more than 70 different types of common symptoms, including fever, rash, stomach ache, runny nose and headaches — and they plan to add more symptoms over time. To generate the list of 10 possible causes for your symptoms, Amazon says Alexa references clinical care guidelines provided by Amazon Care, a medical group that helps customers with a wide range of urgent and primary care services. These possible causes are selected from a supported set of thousands of conditions, such as a common cold, strep throat or an upper respiratory infection. To test the features thoroughness, I started by pretending I was suffering from a few simple health conditions, like the flu, common cold and Covid-19 (of course). Alexa returned the condition I was fishing for within the top three of those 10 responses 100% of the time, and had it listed in the number-one slot almost every time. Then I moved onto more complex conditions, referencing either my own personal experience or that of someone close to me. Diverticulitis, pneumonia and asthma were three I tested, and Alexa nailed it by responding with each of those and a few more all within the top three, although only in the case of asthma was it listed first. Only when I started testing rare or unusual health problems did Alexa trip up — prolapsed mitral valve (a heart condition), Shwachman-Diamond Syndrome (a genetic disorder) and renal cell carcinoma (kidney cancer) did not turn up on the list of possible conditions, although, to be fair, all three of those diagnoses require diagnostic tests, which are not among the list of symptoms Alexa can pull from. What comes next? Alexa s new symptom-checking feature can also connect directly with Teladoc on Alexa, another new health-related service that debuted Feb. 28 and allows you to be connected to a real, live healthcare provider. Currently the service only offers audio visits, but Amazon says video visits will be available soon. Towards the end of the symptom checker experience, Alexa lets you know you can say, I want to speak with a doctor, to get connected with the Teladoc call center. Teladoc starts at $75 without insurance and varies — possibly even free — for those with certain insurance. 17 tips and tricks to get you started on mastering Alexa and your Amazon Echo There are plenty of other ways Amazon is set up to bridge the gap between Alexa s healthcare features and any medical services or information you may seek as a result, too. Besides telehealth consultations with human clinicians and Amazon s online pharmacy (you can check online if it delivers to your address), Alexa stands ready to help you locate a nearby Covid-19 vaccine or booster, set a reminder to take your medications or find the phone number for a nearby provider. How Amazon handles your private data To address concerns about private data, Amazon is quick to point out that symptom checker is not an integral feature of Alexa — you don t have to use it when you buy an Amazon Echo. Other than not using it at all, you can also skip individual questions if you dont feel comfortable answering them, however its unclear how that might affect Alexa s accuracy when responding.Just like anytime you interact with Alexa, you can view, hear and delete your voice recordings through Alexa Privacy Settings or in the Alexa app. You can also say to an Amazon Echo speaker or display, Alexa, delete what I just said, or Alexa, delete everything I said today. Bottom line Healthcare is a fraught issue in the United States, with a vast percentage of the population either uninsured or underinsured, so it worries me that Amazon s disclaimers that Alexa Symptom Checker is for educational purposes only might be wholesale ignored by those suffering medical problems but unable to afford professional care. However, it s somewhat reassuring that, as much as symptom checker doesnt replace the need to seek medical care, especially in an emergency, at least the information it provides is being pulled from Amazon Care — a bona fide, professional healthcare service. Perhaps because of that, Alexa s responses seem to be incredibly accurate when identifying all but the most complex health conditions. Smart speakers have already justified their place in our homes by being useful — allowing us to issue voice commands to play music, set timers and alarms, retrieve the weather report and check the time in a comfortable, convenient way. Devices like Amazon Echo and Echo Show have also proven to be beneficial when we use them to connect over video calls with faraway relatives, prepare healthy recipes or play educational programming for our children. It seems only natural, then, that the features and functions of these devices would eventually evolve to handle more serious tasks like our healthcare questions and needs. Alexa Symptom Checker appears to be a bold step in that direction, adding real value to both the Amazon Echo devices you already own and those you might buy down the road."}]