[{"judul": "How to Implement Patient Portals and Improve Patient Experience", "konten": "Patient portals are growing in popularity and do more than simply provide patients with their health data; they enable patients to engage with their health. A patient portal is basically a website where patients can go to get information about their health or manage the logistics around their health, says Paul Brient, chief product officer at AthenaHealth, an electronic health record vendor serving mainly small to midsize organizations. Rather than using the phone, receiving paper statements or sending paper checks, patient portals allow patients to handle the logistics of health, Brient says. That includes scheduling appointments, communicating with doctors, renewing prescriptions and paying bills. Brient notes that in the days before patient portals, if patients wanted to get their medical records, they would have to submit a medical records request and pay about $20 for a stack of photocopies. Now they may see their test results in patient portals in many cases before their doctors do, he says.These days, chatbots handle the initial communication in a personal portal, such as rescheduling appointments, Brient says. The handoff to staff at the front desk is seamless, he says, when a bot is unable to answer a question. The AI would understand that were off the path and it doesnt know how to deal with the request, so we transfer it to the front desk, Brient says. Portals send notifications via email or text message when they have lab results available to review, an incoming secure message from a provider or a reminder for an upcoming appointment. A properly implemented patient portal adds breadth and depth to the relationship between the patient and provider, says Jerold Greer, CIO at Daymark Recovery Services, a North Carolina-based psychiatric services provider that uses NextGens PxP Patient Portal and EHR software. Patient portals have also evolved from refrigerator magnet appointment reminders to online systems that let patients schedule appointments and communicate with providers, Greer says. They enable synchronous, or continuous, engagement between patients and providers. The patient portal is a key component of our Patient Experience Platform, says Cheryl Lejbolle, vice president of solutions at NextGen Healthcare. It is a personalized, secure website that enables patients to manage their health and interact with their healthcare team. Thats really the purpose of the portal. Daymark provides psychiatric care to patients before they end up in a hospital emergency room, in front of law enforcement or in jail, Greer says. Daymark uses patient portals as a repository to record a patients overall health progress. The organization has successfully enrolled 40,000 patients in its patient portal. Greer cites the Stage 2 requirements of the federal governments Meaningful Use program governing electronic medical records as an impetus for getting patients enrolled in the portal. Through the patient portal, Daymark gives patients a progress meter based on what they should be doing in the current stage of their lives. Completing a healthcare exam could score patients 50 points, and they could also gain points for maintaining adherence to their diabetes or hypertension regimens, Greer says. Thus far, it has been one of the most well-received things weve done with the portal, he says. It becomes a talking point between the care manager and the patient on how to achieve a better score. Greer says Daymark is exploring how it could reward patients for a high progress meter. Patient portals integrate with EHR platforms, and in some cases the integration requires application program interfaces. Weve got all the APIs you need to put a portal on top of our system and create a specific patient experience, Brient says. The patient portal should work with the practice workflow. For example, a practice schedules appointments in a practice management application, providers access it in an EHR, and patients see it in the patient portal. Integrating appointments with an EHR/PM helps prevent duplicate appointments, which can confuse a practices staff as well as patients, Lejbolle says. Automation helps avoid these pitfalls. Plus, the integration with PM software should enable doctors to respond to patients quickly, Lejbolle notes. Doctors send 75 percent of the secure messages on the NextGen platform, she says. When your practice is sending you messages, you know that its important, Lejbolle says. Healthcare organizations looking to implement a new patient portal first need to decide whether to create a patient portal in-house or use a portal available from a patient portal vendor. Creating a patient portal could require a major investment in technology and expertise, so most organizations would likely implement an existing portal. To determine which portal is right for a healthcare organization, health IT leaders need to figure out if the patient portal can integrate with the existing EHR, whether direct API integration is available, and if support is available from the vendor during the implementation process and beyond. An organization should also ensure its patient portal has the right features to meet its needs, including an accessible user experience, two-way secure messaging, custom branding, the ability to schedule appointments through the portal, access to lab results and integration with other documentation workflows. It may be helpful for IT teams to explore use cases to better understand how others have experienced the platform. Jerold Greer Making the patient portal relatable is extremely important. Jerold Greer CIO, Daymark Recovery Services Here are other key steps a healthcare organization should take to implement a new patient portal successfully: Get buy-in from key stakeholders within IT, operational and clinical leadership. Assess current clinical workflows to determine how best to integrate a patient portal with existing programs and processes while improving clinical and patient experiences. Plan an implementation approach that considers training, technical implementation and integration with existing workflows. All relevant staff members should know what they need to do to prepare for the implementation. Determine how large the initial pilot program will be, how long that program will last, and whether there will be a phased approach to the implementation before expanding portal access to the entire hospital. Get patients engaged in the portal and their own health by marketing the portal and communicating with patients about its role in their healthcare experience. Keeping Personal Health Data Secure in Patient Portals. Using a patient portal and EHR application from the same vendor provides more convenience and security, according to Lejbolle. When its the same system, they already have the authentication and processes for the EHR, Lejbolle says. Patient portals also must comply with HIPAA, Lejbolle notes. I think the organization definitely needs to confirm that the portal is HIPAA compliant, she says. That has to be the minimum. Daymark, like many healthcare organizations, delegates responsibility for the portals security to its vendors. Still, healthcare organizations should use two-factor authentication. Athenahealth employs white hat hackers to conduct penetration testing, Brient says. Engaging with Patients and Personalizing Portals Dont expect high enrollment in patient portals overnight, Lejbolle warns. You dont just announce a portal and assume everyone knows about it and will access it, Lejbolle explains. She recommends automatic enrollment when a practice adds a patient to their EHR and patient management platforms. By having multiple points of communication, multiple points of encouragement and then automation, it helps drive some of that utilization, Lejbolle says. Over time, Lejbolle expects patient portals to become more personalized, especially in the languages they support. NextGen currently offers its patient portal in English, Spanish and Chinese, and Lejbolle expects the platform to offer more languages in the future. Making the patient portal relatable is extremely important, Greer says. Brient sees possible synergies between patient portals and smart speakers like the Amazon Echo to allow patients to access medical information, such as glucose numbers.There are a lot of opportunities to take advantage of the digital engagement that exists outside of healthcare and leverage that to help improve our health, Brient says."}]