[{"judul": "WHO Chief: The Pandemic Is ‘Most Certainly Not Over’", "konten": "As you start to build out a smart home, there s one common bugbear you re likely to come across. Unless you pledge allegiance blindly to one smart tech brand, controlling your gadgets is a fractured experience. You might need the Alexa app to sync up a Ring doorbell with an Echo device, Samsungs SmartThings to control your appliances, Google Home to automate your lighting. Plus, each of these devices may well require its own smart hub. The ideal solution would be a way to control all your smart home devices through one channel, but it s easy to question the likelihood of these big tech brands coming together to allow a more diverse smart home set-up, when they could be pushing you to buy their version of a smart home device. That was the big question mark over the concept of Matter, a smart home standard that will allow you to control different devices through one platform, when it was first announced. However, with a launch date now in sight and several brands already committed to embracing Matter going forward, the hype is building. If you re not smart tech-obsessed, its unlikely you ll have heard of Matter already, but the first Matter-compatible devices should be hitting the market any day now. So what is Matter, and why does it, well, matter? We asked some tech experts for their thoughts, and whether Matter is, eventually, going to be worth the hype. WHAT IS MATTER? To get to grips with what Matter actually does, it helps to think of these different tech ecosystems as speaking different languages. Its not possible to control devices through apps that dont speak the same language, however an idea like Matter aims to make this universal. Matter is a new, open-source language which smart home devices can use to communicate with each other, says Daniel P Dykes, a smart home engineer with over 15 years of experience, currently working on smart tech connectivity brand Atrim(opens in new tab) and advising on adaptations to Matter. As it s open-source, it promises that, in comparison to existing standards, a bigger range of products will be Matter compatible, making it easier and cheaper to add smart devices to a home. That means, in essence, that you can invest in the best smart device for your needs, without being bound to a certain brand because you already own that smart hub, whether thats Amazon Alexa, Google Home or Apple HomeKit. Typically, a smart home standard requires users to purchase a dedicated hub, such as Hue Bridge for Philips Hue lighting, Daniel explains, with prices for hubs running from a hundred dollars into the thousands of dollars. This is not so with Matter devices. As the standard has been engineered with contributions from the like of Apple, Amazon, and Google, their voice assistants will largely work as Matter hubs. And, if a product is labeled as Matter compatible, its likely that a users home and phone already feature a compatible hub and app. HOW WILL IT WORK? From your perspective as a user, there wont be much difference in how you operate a smart home device through Matter. It will function much like any other wireless automation standard - devices join a network and can can be automated and controlled privately and securely, Daniel explains. Its functionality differences really all happen away from the eye of the user.To get a little more technical, Matter will operate on wireless chips on the same band as WiFi. This is important to know for a couple of reasons. First of all, because it means it should give you a stable product connection from first use. Secondly, it means that a lot of brands existing devices have the potential to be upgraded to work with Matter with little more than a change to its firmware, making them much more likely to adopt this standard going forward. It also might be the source of one of Matters potential biggest drawbacks. Consider how spotty Wi-Fi can be in particular areas of the average home, Daniel says. Matter is going to suffer exactly the same problem. Though perhaps nothing a good WiFi booster type product would be able to solve. SHOULD I INVEST IN MATTER COMPATIBLE SMART TECH? Matter might sound like a no-brainer idea to evolve the idea of the smart home, but while its got the hype behind it, theres no guarantee it wont go the same way as other concepts that have tried to do the same. From wired to wireless iterations, the automation industry has seen a lot of standards launch over the last decades, Daniel explains, and most have never become popular. Matter has a better chance than most of bucking the trend; after all, its been backed by some of the biggest names in the industry - from Amazon, Apple and Google to Samsung, LG and Philips Hue. For a smart home buyer, its a risk, especially as if you want to use devices that are compatible with Matter, youre probably going to have to buy new ones. Certainly, several brands, amongst them Apple and Hue, have announced that they ll upgrade some of their most recent hub-type products to work with Matter, Daniel says. For instance, Apple s HomePod Mini(opens in new tab) and second generation TV 4K will be upgradeable to work as Matter hubs while other generations wont. In general, theres not much impetus for brands to offer a free upgrade to Matter on their devices, plus not many of their existing devices really can be, as theyd require much more memory than they can handle.  With that in mind, is it worth waiting to buy smart home tech right now to know that you have something Matter compatible? If a home is already using an existing standard, such as Z-Wave, the owner should stick to it. Matter has a lot of hype but very few guarantees, Daniel surmises. For someone looking to purchase their first smart home technology, Matter will definitely be a great option from 2023 onwards when we can expect a broad range of devices to hit the market, he adds. Someone wanting to automate fairly simple routines in their home could look to Matter and a voice assistant-based hub. Those looking for complex, large automation systems will likely find better technology exists elsewhere. WHEN DOES MATTER LAUNCH? Matters official launch is November 3rd, 2022, however, given that an official standard has already been released that manufacturers need to meet, there are already a raft of new products announced that have Matter compatibility, and many more undergoing certification."}]